//	Выполнить задания 1.2 оформив их через функции. Все необходимые данные
// для функций должны передаваться в качестве параметров.Возврат результата
// организовать тремя способами : через механизм return, через
// параметр - указатель, через ссылочный параметр.
// 
//	Присвоить целой переменной h третью от конца цифру в записи натурального
// четырехзначного числа k.

//--------------------------------------------------------------------------
// 
//С помощью return
// 
//#include <iostream>
//
//using namespace std;
//
//int third_n(unsigned int a)
//{
//	return (a / 100) % 10;
//} 
//
//int main()
//{
//	unsigned int k;
//	int h;
//	cout << "k = ";
//	cin >> k;
//	if (k > 9999 || k <= 999)
//		cout << "Not suitable";
//	else
//	{
//		h = third_n(k);
//		cout << "h = " <<  k;
//	}
//	return 0;
//}
//--------------------------------------------------------------------------

//--------------------------------------------------------------------------
//С помощью параметра - указателя
//
//#include <iostream>
//
//using namespace std;
//
//void third_n(unsigned int* a)
//{
//	*a = (*a / 100) % 10;
//}
//
//int main()
//{
//	unsigned int k;
//	int h;
//	cout << "k = ";
//	cin >> k;
//	if (k > 9999 || k <= 999)
//		cout << "Not suitable";
//	else
//	{
//		h = k;
//		third_n(&k);
//		cout << "h = " << k;
//	}
//	return 0;
//}
//--------------------------------------------------------------------------

//--------------------------------------------------------------------------
//С помощью параметра - указателя
//
//#include <iostream>
//
//using namespace std;
//
//void third_n(unsigned int& k)
//{
//	k = (k / 100) % 10;
//}
//
//int main()
//{
//	unsigned int k;
//	int h;
//	cout << "k = ";
//	cin >> k;
//	if (k > 9999 || k <= 999)
//		cout << "Not suitable";
//	else
//	{
//		h = k;
//		third_n(k);
//		cout << "h = " << k;
//	}
//	return 0;
//}
//--------------------------------------------------------------------------