//	Выполнить задания 1.2 оформив их через функции. Все необходимые данные
// для функций должны передаваться в качестве параметров.Возврат результата
// организовать тремя способами : через механизм return, через
// параметр - указатель, через ссылочный параметр.
// 
//	Присвоить целой переменной d четвертую цифру из дробной части
// положительного вещественного числа x.


//--------------------------------------------------------------------------
//С помощью return
//#include <iostream>
//
//using namespace std;
//
//int third_n(double a)
//{
//	return int(a * 10000) % 10;
//}
//
//int main()
//{
//	double x;
//	int d;
//	cout << "x = ";
//	cin >> x;
//
//	d = third_n(x);
//
//	cout << "d = " << d;
//	return 0;
//}
//--------------------------------------------------------------------------

//--------------------------------------------------------------------------
//С помощью параметра - указателя
//#include <iostream>
//
//using namespace std;
//
//int third_n(double* a)
//{
//	return *a = int(*a * 10000) % 10;
//}
//
//int main()
//{
//	double x;
//	int d;
//	cout << "x = ";
//	cin >> x;
//
//	d = third_n(&x); 
//
//	cout << "d = " << d;
//	return 0;
//}
//--------------------------------------------------------------------------

//--------------------------------------------------------------------------
//С помощью ссылочного параметра
//#include <iostream>
//
//using namespace std;
//
//int third_n(double &a)
//{
//	return a = int(a * 10000) % 10;
//}
//
//
//int main()
//{
//	double x;
//	int d;
//	cout << "x = ";
//	cin >> x;
//
//	d = third_n(x);
//
//	cout << "d = " << d;
//	return 0;
//}
//--------------------------------------------------------------------------